---
kind: other
id: Methods.T:Autodesk.Revit.DB.Settings
source: html/bb2aa891-2f54-b50a-b157-5d4711398c96.htm
---
# Settings Methods

Causes the object to release immediately any resources it may be utilizing.